# FileChooser I18N:
titleChooseFiles=Wybierz plik
titleChooseDirectories=Wybierz folder
titleChooseFilesAndDirectories=Wybierz folder lub plik
cancel=Anuluj
fileName=Nazwa pliku
fileType=Type pliku
allFiles=Wszystkie pliki (*.*)
#desktop=Desktop
computer=Komputer
# Used on confirm button when dialog is in OPEN mode
open=Otw\u00F3rz
# Used on confirm button when dialog is in SAVE mode
save=Zapisz
back=Powr\u00F3t
forward=Dalej
parentDirectory=Rodzic
newDirectory=Nowy folder
directoryNoLongerExists=Folder ju\u017C nie istnieje!
popupTitle=Wiadomo\u015B\u0107
popupChooseFile=Musisz wybra\u0107 plik!
popupSelectedFileDoesNotExist=Wybrane pliki nie istniej\u0105!
popupDirectoryDoesNotExist=Ten katalog nie istnieje!
popupOnlyDirectories=Tylko katalogi s\u0105 dozwolone!
popupFilenameInvalid=Nazwa pliku jest niepoprawna!
popupFileExistOverwrite=Ten plik ju\u017C istnieje, czy chcesz go nadpisa\u0107?
popupMultipleFileExistOverwrite=The pliki ju\u017C istniej\u0105, czy chcesz je nadpisa\u0107?
popupDeleteFileFailed=Nast\u0105pi\u0142 b\u0142\u0105d podczas usuwania pliku
# Used when file can't be moved to system trash and has to be deleted permanently
contextMenuDelete=Usu\u0144
# Used when file can be moved to system trash
contextMenuMoveToTrash=Przenie\u015B do kosza
contextMenuNewDirectory=Nowy folder
contextMenuShowInExplorer=Poka\u017C w przegl\u0105darce plik\u00F3w
contextMenuAddToFavorites=Dodaj do ulubionych
contextMenuRemoveFromFavorites=Usu\u0144 z ulubionych
contextMenuDeleteWarning=Ten plik zostanie bezpowrotnie usuni\u0119ty. Czy jeste\u015B pewien?
contextMenuMoveToTrashWarning=Ten plik zostanie przeniesiony do kosza. Czy jeste\u015B pewien?
contextMenuRefresh=Od\u015Bwie\u017C
contextMenuSortBy=Sortuj wed\u0142ug
sortByName=Nazwa
sortByDate=Data modyfikacji
sortBySize=Rozmiar
sortByAscending=Rosn\u0105co
sortByDescending=Malej\u0105co
newDirectoryDialogTitle=Nowy folder
newDirectoryDialogText=Nazwa:
newDirectoryDialogIllegalCharacters=Nazwa katalogu zawiera niepoprawne znaki
newDirectoryDialogAlreadyExists=Katalog o tej nazwie ju\u017C istnieje
changeViewMode=Zmie\u0144 widok
viewModeList=Lista
viewModeDetails=Detale
viewModeBigIcons=Du\u017Ce ikony
viewModeMediumIcons=\u015Arednie ikony
viewModeSmallIcons=Ma\u0142e ikony

prompt0=Stw\u00F3rz nowy projekt
prompt1=!

namePrompt=Wprowad\u017A nazw\u0119 projektu.
nameTip=Musi by\u0107 poprawn\u0105 nazw\u0105 pliku. Mo\u017Ce zawiera\u0107 litery, cyfry, my\u015Blniki (-) i pauzy (_). Na przyk\u0142ad: "TwojaGra", "twoja-gra".
packagePrompt=Wpisz nazw\u0119 g\u0142\u00F3wnej paczki.
packageTip=Musi by\u0107 poprawnym identyfikatorem Javy. Aby poprawnie dzia\u0142a\u0107 na Androidzie, musi zawiera\u0107 przynajmniej jedn\u0105 kropk\u0119. Dla przyk\u0142adu: "pl.twojafirma.twojagra".
classPrompt=Wprowad\u017A nazw\u0119 g\u0142\u00F3wnej klasy.
classTip=Musi by\u0107 poprawnym identyfikatorem Javy. Nie mo\u017Ce zaczyna\u0107 si\u0119 cyfr\u0105. Dla przyk\u0142adu: "Core", "Main", "Root", "TwojaGra".
destinationPrompt=Wybierz folder projektu.
destinationTip=Folder musi by\u0107 pusty. Kliknij na ikonie po prawej, aby wybra\u0107 folder.
mkdirsTip=Utw\u00F3rz folder.
clearFolderTip=Opr\u00F3\u017Cnij folder.
androidSdkPrompt=Wybierz folder Android SDK.
sdkTip=Poprawna lokacja Android SDK. Kliknij na ikonie po prawej, aby wybra\u0107 folder.
useOldestSdkTip=U\u017Cyj najstarszych zainstalowanych wersji Android API oraz build tools. Sprawd\u017A "Zaawansowane" ustawienia po wi\u0119cej informacji.
useLatestSdkTip=U\u017Cyj najnowszych zainstalowanych wersji Android API oraz build tools. Sprawd\u017A "Zaawansowane" ustawienia po wi\u0119cej informacji.

titlePad=1
warn=Uwaga
deletePrompt=Jeste\u015B pewien, \u017Ce chcesz opr\u00F3\u017Cni\u0107 folder?
yes=Tak
no=Nie
deleteError=Nie uda\u0142o si\u0119 opr\u00F3\u017Cni\u0107. Spr\u00F3buj ponownie.

name=Nazwa projektu
package=Paczka
class=G\u0142\u00F3wna klasa
notEmpty={0} nie mo\u017Ce by\u0107 pusta.
nameNotValid=Nazwa projektu mo\u017Ce zawiera\u0107 tylko litery, cyfry, my\u015Blniki (-) i pauzy (_).
classNotValid=G\u0142\u00F3wna klasa nie jej poprawnym identyfikatorem Javy.
packageNotValid=Nazwa paczki nie jej poprawnym identyfikatorem Javy.
notDirectory=Wybrana lokacja projektu nie jest folderem.
sdkNotDirectory=\u015Acie\u017Cka do Android SDK nie jest folderem.
invalidSdkDirectory=Wybrany folder zdaje si\u0119 nie zawiera\u0107 w pe\u0142ni zainstalowanego Android SDK.
notEmptyDirectory=Folder projektu musi by\u0107 pusty.

notUpToDate=Zdaje si\u0119, \u017Ce nie u\u017Cywasz najnowszej wersji gdx-liftoff.
downloadLatest=\u015Aci\u0105gnij najnowszy gdx-liftoff.

platforms=Platformy
platformsPrompt=Najed\u017A na nazwy platform po wi\u0119cej informacji.
toggleClientPlatforms=Zaznacz platformy graficzne
toggleAllPlatforms=Zaznacz wszystkie platformy
androidTip=Mobilna platforma Android. Wymaga Android SDK.
coreTip=Inne platformy maj\u0105 dziel\u0105 ten kod.
desktopTip=Dzia\u0142a na wszystkich znacz\u0105cych desktopowych systemach operacyjnych.
iosTip=Mobilna platforma iOS. U\u017Cywa RoboVM.
ios-moeTip=Mobilna platform iOS. U\u017Cywa Multi-OS Engine.
jglfwTip=Alternatywna platforma desktopwa u\u017Cywaj\u0105ca JGLFW.
lwjgl3Tip=Alternatywna platforma desktopwa u\u017Cywaj\u0105ca LWJGL3. Prawdopodobnie zast\u0105pi obecn\u0105 oficjaln\u0105 platform\u0119 desktopow\u0105 (kt\u00F3ra u\u017Cywa LWJGL2).
htmlTip=Webowa platforma GWT. Wspiera tylko Jav\u0119. Niekt\u00F3re rozszerzenia nie s\u0105 wspierane przez GWT.
headlessTip=Platforma bez aplikacji graficznej. Ma dost\u0119p do trzonu (core). Przydatna do testowania oraz aplikacji serwerowych. Mo\u017Ce by\u0107 u\u017Cyta wraz z gdx-tools jako projekt pomocniczy.
sharedTip=Kod dzielony mi\u0119dzy aplikacj\u0105 klienta oraz serwera.
serverTip=Opcjonalny projekt serwerowy.

languages=J\u0119zyki
language=J\u0119zyk:
languageVersion=Wersja:
languageLink=Info:
languagesPrompt=Uwaga: dodatkowe j\u0119zyki nie dzia\u0142aj\u0105 na platformie GWT.
clojurePrompt=Sprawd\u017A "play-clj": wrapper LibGDX-a oparty o j\u0119zyk Clojure.
otherLanguagesPrompt=Sprawd\u017A ten artyku\u0142 o dodatkowych j\u0119zykach na JVM (en).

extensions=Rozszerzenia
gdx-aiTip=Framework sztucznej inteligencji.
ashleyTip=System encji.
gdx-box2dTip=Silnik fizyki 2D.
box2dlightsTip=System \u015Bwiate\u0142 do silnika fizyki 2D.
gdx-bulletTip=Silnik fizyki 3D. Niekompatybilny z GWT.
gdx-controllersTip=Oficjalne wsparcie dla kontroler\u00F3w.
gdx-freetypeTip=Oficjalne wsparcie dla czcionek TTF. Niekompatybilne z GWT.
gdx-toolsTip=R\u00F3\u017Cne narz\u0119dzia. Tylko dla projekt\u00F3w desktop i headless.
gdxPayPrompt=Zobacz "gdx-pay": wieloplatformowy system p\u0142atno\u015Bci.

thirdParty=Nieoficjalne
thirdPartyPrompt=Alfabetycznie (mniej-wi\u0119cej). Najed\u017A na nazwy po wi\u0119cej informacji.
thirdPartyWarn=Te rozszerzenia NIE s\u0105 udost\u0119pnione przez oficjalnych tw\u00F3rc\u00F3w silnika LibGDX.
thirdPartyLink=Brakuje Twojej biblioteki? Daj zna\u0107!
overlap2dTip=Edytor poziom\u00F3w 2D i GUI. Niedost\u0119pny na GWT.
artemisOdbTip=Wydajny system encji i komponent\u00F3w.
visUiTip=Sk\u00F3rka typu "flat design" do scene2d.ui oraz narz\u0119dzia do GUI.
visRuntimeTip=Wsparcie dla VisEditora. Wybranie VisRuntime spowoduje r\u00F3wnie\u017C do\u0142\u0105czenie rozszerzenia Artemis-odb
uslTip=Alternatywa dla tworzenia skin\u00F3w UI w Json'ie. Pozwala na \u0142atwiejsze rozszerzenie styl\u00F3w.
utilsTip=R\u00F3\u017Cne pomoce i narz\u0119dzia.
utilsBox2dTip=R\u00F3\u017Cne pomoce i narz\u0119dzia do silnika fizyki 2D
facebookTip=Wieloplatformowe wsparcie dla Facebook Graph API. Niedost\u0119pne na GWT.
dialogsTip=Wieloplatformowe wsparcie dla natywnych dialog\u00F3w. Niedost\u0119pne na GWT.
inGameConsoleTip=Implementacja konsoli w grze. Przydatne przy testowaniu, programowaniu i debugowaniu.
jaciTip=Java Annotation Console Interface. Implementacja konsoli w grze. Niedost\u0119pna na GWT.
jaciGwtTip=Java Annotation Console Interface. Implementacja konsoli w grze. Dost\u0119pna na GWT, ale ograniczona - u\u017Cywa API refleksji LibGDX-a.
noise4jTip=Wieloplatformowe generatory map.
kiwiTip=Biblioteka pomocnicza inspirowana rozszerzeniem Guava.
lmlTip=Parser szablon\u00F3w zbli\u017Conych do HTML-a, kt\u00F3ry tworzy GUI Scene2D.
lmlVisTip=Parser szablon\u00F3w zbli\u017Conych do HTML-a, kt\u00F3ry tworzy GUI VisUI.
autumnTip=Mechanizm wstrzykiwania zale\u017Cno\u015Bci z automatycznym skanem komponent\u00F3w. Ograniczony na iOS-ie (na razie brak wsparcia dla automatycznego skanu na tej platformie).
autumnMvcTip=Framework model-widok-kontroler zbudowany na LibGDX-ie, Autumnie i LML.
websocketTip=Wieloplatformowe wsparcie dla web socket\u00F3w.
websocketSerializationTip=Wydajny system serializacji nieoparty na refleksji, dost\u0119pny na wszystkich platformach.
regExodusTip=Implementacja wyra\u017Ce\u0144 regularnych, kt\u00F3ra dzia\u0142a na wszystkich platformach - wliczaj\u0105c GWT.
squidLibUtilTip=Proceduralna generacja, sztuczna inteligencja i inne narz\u0119dzia przydatne przy tworzeniu gier typu roguelike.
squidLibExtraTip=Serializacji w squidlib-util. (I don't speak Polish, please help...)
squidLibTip=Narz\u0119dzia do gier tekstowych u\u017Cywaj\u0105cych LibGDX-a oraz biblioteki squidlib-util.
bladeInkTip=Javowa implementacja Inka: skryptowego j\u0119zyka do pisania interaktywnej narracji.
ktxActorsTip=Narz\u0119dzia pomocnicze do aktor\u00F3w Scene2D napisane w j\u0119zyku Kotlin.
ktxAssetsTip=Narz\u0119dzia pomocnicze do zarz\u0105dzania zasobami napisane w j\u0119zyku Kotlin.
ktxAsyncTip=Narz\u0119dzia pomocnicze do asynchronicznych operacji w j\u0119zyku Kotlin.
ktxBox2dTip=Narz\u0119dzia pomocnicze do silnika fizyki Box2D w j\u0119zyku Kotlin.
ktxAshleyTip=Narz\u0119dzia pomocnicze do silnika Ashley.
ktxAppTip=Narz\u0119dzia pomocnicze do implementacji interfejsu ApplicationListener napisane w j\u0119zyku Kotlin.
ktxCollectionsTip=Narz\u0119dzia pomocnicze do kolekcji napisane w j\u0119zyku Kotlin.
ktxI18nTip=Narz\u0119dzia pomocnicze do t\u0142umaczenia tekst\u00F3w napisane w j\u0119zyku Kotlin.
ktxInjectTip=Prosty, lecz pot\u0119\u017Cny mechanizm wstrzykiwania zale\u017Cno\u015Bci napisany w j\u0119zyku Kotlin.
ktxLogTip=Mechanim logowania napisany w Kotlinie z niewielkim (lub \u017Cadnym) kosztem podczas dzia\u0142ania aplikacji.
ktxMathTip=Narz\u0119dzia pomocnicze do klas powi\u0105zanych z matematyk\u0105 napisane w j\u0119zyku Kotlin.
ktxScene2DTip=Narz\u0119dzia do budowania GUI z Scene2D napisane w j\u0119zyku Kotlin.
ktxStyleTip=Narz\u0119dzia do budowania styli aktor\u00F3w Scene2D napisane w j\u0119zyku Kotlin.
ktxVisTip=Narz\u0119dzia do budowania GUI z VisUI napisane w j\u0119zyku Kotlin.
ktxVisStyleTip=Narz\u0119dzia do budowania styli aktor\u00F3w VisUI napisane w j\u0119zyku Kotlin.
joiseTip=Biblioteka do generowania szumu 2D, 3D, 4D i 6D.
typingLabelTip=Animowany odpowiednik klasy Label.

templates=Szablony
officialTemplates=Oficjalne:
officialTemplatesTip="Oficjalne" szablony u\u017Cywaj\u0105 wy\u0142\u0105cznie g\u0142\u00F3wnych bibliotek LibGDX i nie wymagaj\u0105 \u017Cadnych dodatkowych rozszerze\u0144.
thirdPartyTemplates=Nieoficjalne:
thirdPartyTemplatesTip=Nieoficjalne szablony pokazuj\u0105 u\u017Cycie dodatkowych bibliotek LibGDX. Zwykle s\u0105 dostarczane przez autor\u00F3w u\u017Cywanych rozszerze\u0144.
templatesPrompt=Szablony generuj\u0105 pliki \u017Ar\u00F3d\u0142owe, aby przyspieszy\u0107 tworzenie Twojej aplikacji.
templatesTip=Najed\u017A na nazwy szablon\u00F3w po wi\u0119cej informacji.
templatesStar=Szablony oznaczone * wymagaj\u0105 komendy Gradle "pack", gdy\u017C u\u017Cywaj\u0105 domy\u015Blnej sk\u00F3rki GUI.
templatesLink=Brakuje Twojej bazy projektowej? Zaproponuj nowy szablon!
emptyTemplate=Pusty
emptyTemplateTip=Nie generuje plik\u00F3w \u017Ar\u00F3d\u0142owych.
applicationListenerTip=Generuje podstawowe launchery aplikacji. G\u0142\u00F3wna klasa implementuje ApplicationListener. Sama aplikacja pocz\u0105tkowo nic nie robi.
applicationAdapterTip=Generuje podstawowe launchery aplikacji. G\u0142\u00F3wna klasa rozszerza ApplicationAdapter. Sama aplikacja pocz\u0105tkowo nic nie robi.
inputProcessorTip=Generuje podstawowe launchery aplikacji. G\u0142\u00F3wna klasa implementuje ApplicationListener i rozszerza InputAdapter, aby nas\u0142uchiwa\u0107 akcji u\u017Cytkownika. Aplikacja ustawia siebie jako globalny InputProcessor.
gameTemplateTip=Generuje podstawowe launchery aplikacji. G\u0142\u00F3wna klasa rozszerza Game. Aplikacja ustawia FirstScreen jako pierwszy widok. Pocz\u0105tkowy ekran nic nie robi.
scene2dTemplateTip=Generuje podstawowe launchery aplikacji. G\u0142\u00F3wna klasa rozszerza ApplicationAdapter oraz tworzy prost\u0105 scen\u0119 Scene2D. Wymusza wygenerowanie zasob\u00F3w GUI. Wykonaj polecenie "gradle pack", zanim uruchomisz aplikacj\u0119.
classic=Klasyczny
classicTip=Oparte o poprzedni\u0105 aplikacj\u0119 gdx-liftoff. Generuje podstawowe launchery aplikacji. G\u0142\u00F3wna klasa rozszerza ApplicationAdapter oraz rysuje proste logo Badlogic Games na \u015Brodku ekranu.
autumnMvcBasicTemplateTip=Pokazuje, jak stworzy\u0107 prosty widok za pomoc\u0105 frameworka Autumn MVC. U\u017Cywa domy\u015Blnej sk\u00F3rki GUI. Wykonaj polecenie "gradle pack", zanim uruchomisz aplikacj\u0119.
autumnMvcVisTemplateTip=Pokazuje zaawansowane u\u017Cycie frameworka Autumn MVC. Pozwala na tworzenie widget\u00F3w VisUI dzi\u0119ki rozszerzeniu gdx-lml-vis. Solidna baza pod aplikacje korzystaj\u0105ce z Autumn MVC.
autumnMvcBox2dTemplateTip=Zaawansowany przyk\u0142ad aplikacji u\u017Cywaj\u0105cej frameworka Autumn MVC. Korzysta z rozszerze\u0144: Box2D, Controllers, VisUI. Tworzy prosty \u015Bwiat Box2D. Pozwala graczom na wyb\u00F3r sterowania. Zawiera prosty dialog ustawie\u0144 gry. Solidna baza pod gry platformowe oparte o Box2D.
lmlTemplateTip=U\u017Cywa biblioteki do GUI: gdx-lml. Zmodyfikowany szablon Scene2D, kt\u00F3ry u\u017Cywa LML, by stworzy\u0107 ekran. Uwaga: to pokazuje jedynie podstawy - s\u0105 nawet prostsze sposoby u\u017Cycia LML (sprawd\u017A te\u017C inne przyk\u0142adowe szablony LML). U\u017Cywa domy\u015Blnej sk\u00F3rki GUI. Wykonaj polecenie "gradle pack", zanim uruchomisz aplikacj\u0119.
noise4jTemplateTip=U\u017Cywa biblioteki noise4j, aby wygenerowa\u0107 mapy w czasie dzia\u0142ania aplikacji. Kliknij, aby wygenerowa\u0107 inn\u0105 map\u0119.
kiwiTemplateTip=U\u017Cywa biblioteki pomocniczej gdx-kiwi. Jest to "klasyczny" szablon, usprawniony o u\u017Cycie narz\u0119dzi z biblioteki Kiwi.
kiwiInputTemplateTip=G\u0142\u00F3wna klasa rozszerza InputAwareApplicationListener, co pozwala jej na nas\u0142uchiwanie i wydarze\u0144 aplikacji, i akcji u\u017Cytkownika. Rysuje logo Badlogic Games na \u015Brodku ekranu i zmienia jego kolor po klikni\u0119ciu lub dotyku.
webSocketBasicTemplateTip=Przyk\u0142adowe u\u017Cycie bibliteki gdx-websocket. Pokazuje u\u017Cycie klienta web socketowego obs\u0142uguj\u0105cego wiele platform. Pozwala po\u0142\u0105czy\u0107 si\u0119 z zewn\u0119trznym serwerem i wysy\u0142a\u0107 tekstowe wiadomo\u015Bci. U\u017Cywa biblioteki VisUI, aby utworzy\u0107 prosty interfejs.
visUiBasicTemplateTip=Prosty przyk\u0142ad pokazuj\u0105cy jak doda\u0107 VisUI do projektu.
visUiShowcaseTemplateTip=Przyk\u0142adowa aplikacja VisUI z paskiem menu i pokazem widget\u00F3w.
visEditorBasicTemplateTip=Przyk\u0142adowa aplikacja pokazuj\u0105ca jak za\u0142adowa\u0107 wyeksportowany projekt VisEditora. Projekt mo\u017Ce zosta\u0107 tak\u017Ce otworzony w VisEditorze.
squidLibBasicTemplateTip=Prosta aplikacja korzystaj\u0105ca z rozszerzenia SquidLib.

advanced=Zaawansowane
localePrompt=Zmie\u0144 j\u0119zyk:
localeWarn=Uwaga: prze\u0142adowuje aplikacj\u0119!
version=Wersja aplikacji:
versionTip=Wersja aplikacji u\u017Cywana przez Gradle przy budowaniu archiw\u00F3w.
gdxVersion=Wersja LibGDX-a:
gdxVersionTip=Wersja oficjalnych bibliotek silnika LibGDX. Najnowsza wersja to {0}.
gwtVersion=Wersja GWT:
gwtVersionTip=Wersja bibliotek GWT. Powinna odpowiada\u0107 wersji u\u017Cytej do zbudowania backendu GWT. Domy\u015Blnie 2.8.0. NIE ma gwarancji, \u017Ce inne wersje b\u0119d\u0105 dzia\u0142a\u0107 z uwagi na zmiany w API. LibGDX przed wersj\u0105 1.9.5 u\u017Cywa\u0142 GWT 2.6.1.
gwtPlugin=Wersja plugina GWT:
gwtPluginTip=Wersja plugina Gradle do aplikacji GWT: de.richsource.gradle.plugins:gwt-gradle-plugin
sdkVersion=Android API:
sdkVersionTip=Wersja docelowego API Androida.
toolsVersion=Wersja narz\u0119dzi:
toolsVersionTip=Wersja "build tools" Androida.
androidPluginVersion=Plugin Androida:
androidPluginVersionTip=Wersja plugina Gradle projektu Androidowego.
robovmVersion=Wersja RoboVM:
robovmVersionTip=Wersja frameworka RoboVM u\u017Cywanego przez domy\u015Bln\u0105 platform\u0119 iOS.
moeVersion=Wersja MOE:
moeVersionTip=Wersja Intel Multi-OS Engine u\u017Cywana przez backend iOS-MOE.
javaVersion=Wersja Javy:
javaVersionTip=Docelowa wersja kodu \u017Ar\u00F3d\u0142owego. 1.6 jest proponowana, je\u017Celi planujesz u\u017Cywa\u0107 innych platform ni\u017C desktop.
serverJavaVersion=Wersja Javy serwera:
serverJavaVersionTip=Docelowa wersja kodu \u017Ar\u00F3d\u0142owego aplikacji serwerowej i headless. 1.8 to najnowsza stabilna i powszechnie u\u017Cywana wersja Javy.
desktopJavaVersion=Wersja Javy desktopu:
desktopJavaVersionTip=Docelowa wersja kodu \u017Ar\u00F3d\u0142owego aplikacji dekstopowych. Wersja (przynajmniej) 1.7 jest wymagana przez u\u017Cywane biblioteki.
generateSkin=Dodaj zasoby GUI
generateSkinTip=Je\u017Celi to pole jest zaznaczone, generator stworzy folder "raw" z zasobami GUI i doda task "pack" do pliku Gradle, kt\u00F3ry pozwala szybko spakowa\u0107 atlas. Uwaga: sam atlas na pocz\u0105tku nie jest pakowany - wywo\u0142aj "gradle pack", zanim zaczniesz u\u017Cywa\u0107 sk\u00F3rki.
generateUsl=Dodaj zasoby USL
generateUslTip=Je\u017Celi to pole jest zaznaczone, generator stworzy folder "raw" z przyk\u0142adowym plikiem USL oraz doda task "compileSkin" do pliku Gradle kt\u00F3ry pozwala na automatyczne skompilowanie sk\u00F3rki USL do Jsona. Skin nie jest skompilowany po wygenerowaniu projektu - wywo\u0142aj "gradle compileSkin" przed u\u017Cyciem sk\u00F3rki.
generateReadme=Dodaj README
generateReadmeTip=Tworzy plik README.md (w j\u0119zyku angielskim), cz\u0119sto u\u017Cywany do opisu projekt\u00F3w. Plik b\u0119dzie zawiera\u0142 prosty opis oraz kilka wskaz\u00F3wek na temat polece\u0144 Gradle, kt\u00F3re mog\u0105 si\u0119 przyda\u0107.
gradleWrapper=Dodaj wrapper Gradle
gradleWrapperTip=Je\u017Celi to pole jest zaznaczone, generator stworzy pliki wykonywalne "gradlew" oraz "gradlew.bat", kt\u00F3re pozwalaj\u0105 uruchomi\u0107 aplikacj\u0119 Gradle bez jej globalnego instalowania. O ile to wygodne rozwi\u0105zanie, je\u017Celi masz j\u0105 ju\u017C zainstalowan\u0105, mo\u017Cesz wy\u0142\u0105czy\u0107 t\u0119 opcj\u0119, aby zmniejszy\u0107 ca\u0142kowit\u0105 wielko\u015B\u0107 plik\u00F3w projektu.
gradleTasksPrompt=Wprowad\u017A polecenia Gradle, kt\u00F3re zostan\u0105 wykonane po generacji projektu.
gradleTasksTip=Generator mo\u017Ce opcjonalnie wykona\u0107 polecania Gradle, gdy projekt jest ju\u017C gotowy. Je\u017Celi u\u017Cywasz wrappera Gradle, b\u0119dzie on u\u017Cyty do wykonania zada\u0144 - w innym wypadku generator zak\u0142ada, \u017Ce Gradle jest zainstalowane globalnie i dost\u0119pne pod komend\u0105 "gradle". Nie musisz wpisywa\u0107 "gradle" ani "gradlew" - wystarczy, \u017Ce podasz nazwy samych polece\u0144. Sugerowane polecenia:\n- pack - je\u017Celi zasoby GUI zosta\u0142y wygenerowane, pakuje atlas GUI.\n- idea - generuje dane projektu IntelliJ.\n- eclipse - generuje dane projektu Eclipse.\n- desktop:run - uruchamia aplikacj\u0119 desktopow\u0105, pozwalaj\u0105c na przetestowanie szablonu
gdxSkinsPrompt=Szukasz sk\u00F3rek Scene2D? Sprawd\u017A projekt gdx-skins!

formValid=Dane Twojego projektu s\u0105 poprawne!
generate=Wygeneruj projekt!

generationTitle=Generowanie...
generationPrompt=Nowy projekt jest tworzony, prosz\u0119 czeka\u0107.
closeDialog=Zamknij okno
exit=Wy\u0142\u0105cz aplikacj\u0119
copyStart=Przygotowanie projektu...
copyEnd=Pliki projektu skopiowane.
copyGradle=Skopiowano wrapper Gradle.
runningGradleTasks=Wykonywanie polece\u0144 Gradle:
generationEnd=Projekt jest gotowy. Wi\u0119kszo\u015B\u0107 IDE pozwala go zaimportowa\u0107 jako "Gradle project". Przydatne polecenia Gradle:\n- idea: generuje projekt IntelliJ\n- eclipse: generuje projekt Eclipse\n- pack: pakuje atlas z plikami GUI (je\u017Celi wybrano opcj\u0119 wygenerowania GUI w zaawansowanych)\n- desktop:run - uruchamia aplikacj\u0119 desktopow\u0105.\n- gwt:superDev - kompiluje aplikacj\u0119 GWT i pozwala j\u0105 debugowa\u0107 pod adresem localhost:8080/gwt
generationFail=Nie uda\u0142o si\u0119 wygenerowa\u0107 projektu z powodu wyj\u0105tku. Spr\u00F3buj ponownie.
